# IsIntegerValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..IsIntegerValue Property
ScheduleFilter Class See Also
---
Indicates if the filter has an integer value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsIntegerValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsIntegerValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsIntegerValue {
	bool get ();
}
```

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace